tutorials/13.1.1.1D_2phase_4componentGas_YCO2i_0_compositionalPoreSwGLSDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2_eql/0/invK.rock
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volDiagTensorField;
    location    "0";
    object      invK.rock;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions                    [0 -2 0 0 0 0 0];
internalField                 uniform (1e4 1e4 1e4);
boundaryField
{
    inlet
    {
        type                          fixedValue ;
       	value                         uniform (1e4 1e4 1e4);
	//type                          zeroGradient;
    }
    outlet
    {
        type                          zeroGradient;
    }
    yzfaces
    {
        type                          empty;
    }
}


//************************************************************************** //
