tutorials/13.1.1.1D_2phase_4componentGas_YCO2i_0_compositionalPoreSwGLSDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2_eql/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoPhysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solutionSpecies
{
   Species 
	{
		D1 [ 0 2 -1 0 0 0 0 ] 2e-7;
		D2 [ 0 2 -1 0 0 0 0 ] 2e-7;
		H [ 1 -1 -2 0 0 0 0 ] 3.8e8; 
		Psat [1 -1 -2 0 0 0 0] 20e3;
                Mw [1 0 0 0 -1 0 0] 18; 
                Mg [1 0 0 0 -1 0 0] 44; 
		Ms [1 0 0 0 -1 0 0] 58.44;
		Rhos [1 -3 0 0 0 0 0] 2160;
	}
};

// ************************************************************************* //
